package com.example.cactus

object CactusGenerator {

    fun getItems() = listOf<Cactus>(
        Cactus(name = "Astrophytum Asterias",
            description = "Astrophytum asterias มีกำเนิดมาจากภูเขาและที่ดินทรายในภูมิภาคตะวันตกของอาร์เจนตินา\n" +
                    "มีลำต้นทรงกลมหรือทรงกระบอก และมีลักษณะรอยแห้งเป็นลายดาวหรือลายสามเหลี่ยมบนผิวลำต้น ทำให้ดูเป็นพิเศษและสวยงาม ดอกขนาดเล็กและสวยงาม สีขาวหรือเหลืองอ่อนและบานตอนกลางคืน\n" +
                    "Astrophytum asterias เติบโตได้ดีในที่ที่มีแสงแดดเพียงพอ แต่ควรป้องกันจากรังแสงแดดร้อนที่มีช่วงเวลานานเกินไป เหมาะสำหรับการปลูกในสวนกลางแจ้งหรือในที่ที่มีแสงแดดอย่างเต็มที่\n"
            ,
            R.drawable.astrophytum_asterias
        ),
        Cactus(name = "Echinopsis Calochlora",
            description = "Echinopsis calochlora เป็นไม้ลูกเต่าที่มีกำเนิดมาจากภูเขาและที่ดินที่ร่วนปนทรายในภูมิภาคตะวันตกของอาร์เจนตินา\n" +
                    "มีลำต้นทรงกระบอกและทรงกระบอกแบบกระจก สูงได้ถึง 6-12 นิ้ว (15-30 ซม.) และมีเส้นผ่านศูนย์กลางที่ชัดเจน มีดอกสวยงามที่มีขนาดใหญ่สีขาวหรือสีเหลืองอ่อน ดอกจะบานตอนกลางคืน เป็นที่นิยมในการปลูกเพื่อการจัดแสดงและการตกแต่ง\n" +
                    "Echinopsis calochlora เติบโตได้ดีในที่ที่มีแสงแดดเพียงพอ แต่สามารถป้องกันจากรังแสงแดดร้อนที่มีช่วงเวลานานเกินไป ทนทานต่ออากาศร้อนและแห้ง\n"
            ,
            R.drawable.echinopsis_calochlora
        ),
        Cactus(name = "Euphorbia Decaryi",
            description = "Euphorbia decaryi เป็นพืชที่มีรากที่เข้มและมีกำเนิดมาจากมาดากัสการ์ และทางตะวันตกเฉียงใต้ของมาดากัสการ์\n"+
                    " มีลำต้นทรงกระบอก หรือทรงกระบอกที่มีชีวิต ลำต้นมีลักษณะรอยดำหรือดำเข้มที่ด้านบน มักออกดอกเป็นสีขาวหรือเหลือง\n" +
                    "Euphorbia decaryi เติบโตได้ดีในที่ที่มีแสงแดดเพียงพอ แต่ควรป้องกันจากรังแสงแดดร้อนที่มีช่วงเวลานานเกินไป เหมาะสำหรับการปลูกในสวนกลางแจ้งหรือในที่ที่มีแสงแดดอย่างเต็มที่\n"
            ,
            R.drawable.euphorbia_decaryi
        ),
        Cactus(name = "Gymnocalycium Baldianum",
            description = "Gymnocalycium baldianum เป็นที่มาจากภูเขาและที่ดินทรายในภูมิภาคตะวันตกของอาร์เจนตินา\n"+
                    "มีลำต้นทรงกระบอก มักมีลายหรือลักษณะเด่นบนผิวลำต้น สีของลำต้นทั่วไปเป็นสีเขียว มีดอกขนาดเล็กที่บานตอนกลางคืน สีขาวหรือสีชมพูอ่อน\n"+
                    "Gymnocalycium baldianum ชอบแสงแดดเต็มที่ ควรปลูกในที่ที่ได้รับแสงแดดมาก ทนทานต่ออากาศร้อนและแห้ง เป็นพืชที่ทนทานและเหมาะสำหรับการเลี้ยงในสวนสาธารณะหรือสวนบ้าน\n"
            ,
            R.drawable.gymnocalycium_baldianum
        ),
        Cactus(name = "Gymnocalycium Sepia",
            description = "Gymnocalycium sepia เป็นไม้ลูกเต่าที่เจริญเติบโตในภูมิภาคที่แห้งและร้อนของอาร์เจนตินา\n" +
                    "มีลำต้นกลมหรือทรงกระบอก มีสีน้ำตาลหรือสีเข้มของลำต้นและขอบกลีบดอกทำให้ Gymnocalycium sepia มีลักษณะเด่นที่น่าสนใจ\n"+
                    "Gymnocalycium sepia ต้องการแสงแดดเต็มที่ แต่อาจต้องป้องกันจากรังแสงที่มีความร้อนเกินไปในช่วงเวลาที่ร้อน มักจะเติบโตได้ดีในดินทรายหรือผสมดินที่มีการระบายน้ำดี ในสภาพอากาศที่มีอากาศแห้ง ต้องรักษาระดับความชื้นในดินให้เหมาะสม\n",
            R.drawable.gymnocalycium_sepia
        ),
    )

}